 #ახსენით რა განსხვავებაა While და for loop-ებს შორის

 #while ციკლი
#while ციკლი შესრულდება მანამ, სანამ მოცემული პირობა სიმართლე იქნება (True). მისი გამოყენება უკეთესია, როცა არ ვიცით, რამდენჯერ უნდა გავიმეოროთ მოქმედება, მაგრამ ვიცით, რომ ციკლი უნდა გაგრძელდეს მანამ, სანამ გარკვეული პირობა არ შესრულდება.



#for ციკლი
#for ციკლი გამოიყენება, როდესაც ვიცით ზუსტად, რამდენჯერ უნდა შესრულდეს მოქმედება. ჩვეულებრივ, for ციკლი იყენებს სიებს, მასივებს, ან ვერიფიკაციას, რათა განსაზღვროს რამდენჯერ უნდა გამეორდეს ქმედება.