#მნიშვნელოვანი დეტალები რაც უნდა ვიცოდეთ while_loop_ზე
#1.while_loop გამოიყენება იმისათვის რომ მანამ სანამ კონკრეტულ იფნორმაციას არ მივიღებთ რაც ჩვენ გვინდა შეგვიძლია ეს ლუპი ვატრიალოთ მანამდე
#2.while_loop ასევე ამოწმებს კოდს და შეგვიძლია ჩვენ მას მივცეთ ფუნქცია რის მიხედვითაც ლუპი იტრიალებს მანამ სანამ ჭეშმარიტება არ დადგება მაგალითად:

#right_password = "blah"

#while True:
#    text = input("Enter password: ")
    
#    if text == right_password:
#        print("You have entered the right password!")
#        break  
#    else:
#        print("Incorrect password, please try again.")
#ამ მაგალითში ნათლად ჩანს while_loops ის ფუნქცია რის მიხედვითაც სანამ ჩვენი შემოყვანილი ცვლადი არ შესაბამებოდა მომხმარებლის შემოსულ მაგალითს მანამ  loop იტრიალებდა 

#3.უსასრულო ციკლის (Infinite Loop) შესაძლებლობა – თუ ციკლის პირობამ არასდროს მიაღწია False-ს, ციკლი უსასრულოდ გაგრძელდება.


# for_loop ის ძირითადი თვისებები:
#1 არის ის რომ ჩვენ შეგვიძლია განმეორეად ობიექტებზე იტერაციის მოხდენა, მაგალითად:
#numbers = [1, 2, 3, 4, 5]
#for num in numbers:
 #   print(num)
#
#2 ჩვენ შეგვიძლია მივუითოთ i ის საიდან დაიწყოს  range-ში და თუ სად გაჩერედეს ზუსტად ანუ განსაზღვრული გამეორებების რაოდენობა
#for i in range(5):  # იმუშავებს 5-ჯერ (0-დან 4-მდე)
 #   print(i)
#3 ელემენტებზე პირდაპირი წვდომა მაგალითად:
#word = "Python"
#for letter in word:
#   print(letter)
#ამ მაგალთში გამოვტიანთ თითოეულ ასობგერას ცალ-ცალკე


